#+TITLE: Econometría — Gujarati, Capítulo 13
#+SUBTITLE: Especificación de Modelos y Errores de Especificación
#+DATE: <2026-05-08>
#+AUTHOR: Emanuel Quintana Silva
#+LANGUAGE: es
#+OPTIONS: toc:2 num:t ^:nil
#+PROPERTY: header-args:stata :results output :exports both

* Ejercicio 13.1

#+BEGIN_QUOTE
Consulte la función de demanda de pollos estimada en la ecuación (8.6.23).
Considerando los atributos de un buen modelo analizados en la sección 13.1,
¿puede decir que esta función de demanda está especificada "correctamente"?
#+END_QUOTE

** Contexto teórico

Para evaluar si la función de demanda de pollos estimada mediante la
ecuación (8.6.23) está correctamente especificada, la sometemos a los
/seis atributos/ de un buen modelo definidos en la sección 13.1 de Gujarati.

El modelo estimado es:

$$\widehat{\ln Y_t} = 2.1898 + 0.3425\,\ln X_{2t} - 0.5046\,\ln X_{3t}
+ 0.1485\,\ln X_{4t} + 0.091\,\ln X_{5t}$$

donde las variables son:

| Símbolo   | Definición                                                    |
|-----------+---------------------------------------------------------------|
| $Y_t$     | Consumo per cápita de carne de pollo (lbs.)                   |
| $X_{2t}$  | Ingreso per cápita real disponible ($)                        |
| $X_{3t}$  | Precio real al menudeo del pollo por lb. (¢)                  |
| $X_{4t}$  | Precio real al menudeo del cerdo por lb. (¢)                  |
| $X_{5t}$  | Precio real al menudeo de la carne de res por lb. (¢)         |
| $X_{6t}$  | Precio compuesto ponderado de sustitutos por lb. (¢)          |

** Evaluación de los seis atributos

*** 1. Admisibilidad de los datos (/Data Admissibility/)

El modelo utiliza forma /log-log/ (doble logaritmo). Esta especificación
garantiza que las predicciones de la cantidad demandada $\hat{Y}$ sean
siempre *positivas*, condición necesaria para cualquier bien físico.

*Cumple* este criterio.

*** 2. Consistencia con la teoría económica

La microeconomía establece que la demanda de un bien depende de su precio,
del ingreso del consumidor y de los precios de bienes sustitutos y
complementarios.

- La *elasticidad precio* estimada es negativa ($-0.5046$): coherente con
  la ley de la demanda.
- La *elasticidad ingreso* es positiva ($+0.3425$): coherente con un bien
  normal.

Sin embargo, los precios de los sustitutos ($X_4$, $X_5$) resultaron
*conjuntamente insignificantes* ($p = 0.3472$), lo que plantea dos
posibilidades: (i) error de especificación muestral, o (ii) multicolinealidad
que oculta la verdadera relación teórica.

*Cumplimiento parcial* — los signos son correctos pero la insignificancia
de los sustitutos es teóricamente cuestionable.

*** 3. Regresores débilmente exógenos (/Weak Exogeneity/) — Falla crítica

Este es el punto más débil del modelo.

En un mercado competitivo, precio ($P$) y cantidad ($Q$) se determinan
*simultáneamente* mediante la intersección de oferta y demanda. Al usar
MCO para estimar una sola ecuación de un sistema simultáneo:

$$\text{Cov}(X_{3t},\, u_t) \neq 0$$

Los estimadores MCO son *sesgados e inconsistentes*. Sin el uso de
*Variables Instrumentales (VI)* o *Mínimos Cuadrados en Dos Etapas
(MC2E)*, los parámetros estimados no representan las verdaderas
elasticidades estructurales.

*No cumple* — violación del supuesto de exogeneidad débil.

*** 4. Constancia de los parámetros (/Parameter Constancy/)

El modelo utiliza datos de *1960 a 1982*, período que incluye eventos
estructurales relevantes (crisis del petróleo de 1973, cambios en patrones
de consumo). No se presentan pruebas de cambio estructural como la
*prueba de Chow* para verificar la estabilidad de los coeficientes.

*No verificado* — ausencia de pruebas formales de estabilidad.

*** 5. Coherencia de los datos (/Data Coherency/)

En series de tiempo es común la *autocorrelación*. Si los residuos no
se comportan como ruido blanco, el estadístico $d$ de Durbin-Watson
diferirá significativamente de 2, indicando que el modelo omite
información relevante o tiene forma funcional inadecuada.

*Requiere verificación* empírica del estadístico $d$.

*** 6. Capacidad de inclusión (/Encompassing/)

No se discute si el modelo es capaz de explicar los resultados de modelos
rivales. Bajo la *prueba J de Davidson-MacKinnon*, un modelo superior
debe dejar sin poder explicativo adicional a las predicciones de un
modelo competidor (e.g., especificación lineal vs. log-log).

*No evaluado* en el texto original.

** Veredicto

#+BEGIN_QUOTE
A pesar del alto $R^2 = 0.9823$ y de los signos coherentes con la teoría,
*no se puede afirmar que esta función está especificada correctamente*
bajo los estándares de la sección 13.1.
#+END_QUOTE

La violación principal es la *falta de exogeneidad débil* de los regresores
debido a la *simultaneidad* inherente en la determinación del precio y la
cantidad en el mercado. Sin el uso de VI o MC2E, los parámetros estimados
son inconsistentes y no representan las verdaderas elasticidades
estructurales de la demanda.

* Ejercicio 13.2 — Verificación empírica con los datos de Gujarati

** Paso 1 — Cargar datos y guardar archivo de trabajo

Este es el bloque base. Carga los datos, genera los logaritmos
y los guarda en =C:\tmp\gujarati.dta= para que todos los bloques
siguientes puedan usarlos sin repetir la entrada de datos.

#+NAME: datos-gujarati
#+BEGIN_SRC stata
clear
input año y x2 x3 x4 x5 x6
1960  27.8  397.5   42.2   50.7   78.3   65.8
1961  29.9  413.3   38.1   52.0   79.2   66.9
1962  29.8  439.2   40.3   54.0   79.2   67.8
1963  30.8  459.7   39.5   55.3   79.2   69.6
1964  31.2  492.9   37.3   54.7   77.4   68.7
1965  33.3  528.6   38.1   63.7   80.2   73.6
1966  35.6  560.3   39.3   69.8   80.4   76.3
1967  36.4  624.6   37.8   65.9   83.9   77.2
1968  36.7  666.4   38.4   64.5   85.5   78.1
1969  38.4  717.8   40.1   70.0   93.7   84.7
1970  40.4  768.2   38.6   73.2  106.1   93.3
1971  40.3  843.3   39.8   67.8  104.8   89.7
1972  41.8  911.6   39.7   79.1  114.0  100.7
1973  40.4  931.1   52.1   95.4  124.1  113.5
1974  40.7 1021.5   48.9   94.2  127.6  115.3
1975  40.1 1165.9   58.3  123.5  142.9  136.7
1976  42.7 1349.6   57.9  129.9  143.6  139.2
1977  44.1 1449.4   56.5  117.6  139.2  132.0
1978  46.7 1575.5   63.7  130.9  165.5  132.1
1979  50.6 1759.1   61.6  129.8  203.3  154.4
1980  50.1 1994.2   58.9  128.0  219.6  174.9
1981  51.7 2258.1   66.4  141.0  221.6  180.8
1982  52.9 2478.7   70.4  168.2  232.6  189.4
end

label variable y   "Consumo per cápita de pollo (lbs.)"
label variable x2  "Ingreso per cápita real ($)"
label variable x3  "Precio real pollo (¢/lb.)"
label variable x4  "Precio real cerdo (¢/lb.)"
label variable x5  "Precio real res (¢/lb.)"
label variable x6  "Precio compuesto sustitutos (¢/lb.)"

gen ly  = ln(y)
gen lx2 = ln(x2)
gen lx3 = ln(x3)
gen lx4 = ln(x4)
gen lx5 = ln(x5)
gen lx6 = ln(x6)

save "C:\tmp\gujarati.dta", replace

describe
summarize
#+END_SRC

#+RESULTS: datos-gujarati
#+begin_example
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\tmp\stata_out_206983.log
  log type:  text
 opened on:   9 May 2026, 22:41:33

. clear

. input año y x2 x3 x4 x5 x6

          año          y         x2         x3         x4         x5         x6
  1. 1960  27.8  397.5   42.2   50.7   78.3   65.8
  2. 1961  29.9  413.3   38.1   52.0   79.2   66.9
  3. 1962  29.8  439.2   40.3   54.0   79.2   67.8
  4. 1963  30.8  459.7   39.5   55.3   79.2   69.6
  5. 1964  31.2  492.9   37.3   54.7   77.4   68.7
  6. 1965  33.3  528.6   38.1   63.7   80.2   73.6
  7. 1966  35.6  560.3   39.3   69.8   80.4   76.3
  8. 1967  36.4  624.6   37.8   65.9   83.9   77.2
  9. 1968  36.7  666.4   38.4   64.5   85.5   78.1
 10. 1969  38.4  717.8   40.1   70.0   93.7   84.7
 11. 1970  40.4  768.2   38.6   73.2  106.1   93.3
 12. 1971  40.3  843.3   39.8   67.8  104.8   89.7
 13. 1972  41.8  911.6   39.7   79.1  114.0  100.7
 14. 1973  40.4  931.1   52.1   95.4  124.1  113.5
 15. 1974  40.7 1021.5   48.9   94.2  127.6  115.3
 16. 1975  40.1 1165.9   58.3  123.5  142.9  136.7
 17. 1976  42.7 1349.6   57.9  129.9  143.6  139.2
 18. 1977  44.1 1449.4   56.5  117.6  139.2  132.0
 19. 1978  46.7 1575.5   63.7  130.9  165.5  132.1
 20. 1979  50.6 1759.1   61.6  129.8  203.3  154.4
 21. 1980  50.1 1994.2   58.9  128.0  219.6  174.9
 22. 1981  51.7 2258.1   66.4  141.0  221.6  180.8
 23. 1982  52.9 2478.7   70.4  168.2  232.6  189.4
 24. end

.
. label variable y   "Consumo per cápita de pollo (lbs.)"

. label variable x2  "Ingreso per cápita real ($)"

. label variable x3  "Precio real pollo (¢/lb.)"

. label variable x4  "Precio real cerdo (¢/lb.)"

. label variable x5  "Precio real res (¢/lb.)"

. label variable x6  "Precio compuesto sustitutos (¢/lb.)"

.
. gen ly  = ln(y)

. gen lx2 = ln(x2)

. gen lx3 = ln(x3)

. gen lx4 = ln(x4)

. gen lx5 = ln(x5)

. gen lx6 = ln(x6)

.
. save "C:\tmp\gujarati.dta", replace
(file C:\tmp\gujarati.dta not found)
file C:\tmp\gujarati.dta saved

.
. describe

Contains data from C:\tmp\gujarati.dta
 Observations:            23
    Variables:            13                  9 May 2026 22:41
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
año             float   %9.0g
y               float   %9.0g                 Consumo per cápita de pollo (lbs.)
x2              float   %9.0g                 Ingreso per cápita real ($)
x3              float   %9.0g                 Precio real pollo (¢/lb.)
x4              float   %9.0g                 Precio real cerdo (¢/lb.)
x5              float   %9.0g                 Precio real res (¢/lb.)
x6              float   %9.0g                 Precio compuesto sustitutos (¢/lb.)
ly              float   %9.0g
lx2             float   %9.0g
lx3             float   %9.0g
lx4             float   %9.0g
lx5             float   %9.0g
lx6             float   %9.0g
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by:

. summarize

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         año |         23        1971     6.78233       1960       1982
           y |         23    39.66957     7.37295       27.8       52.9
          x2 |         23    1035.065     617.847      397.5     2478.7
          x3 |         23    47.99565    11.11721       37.3       70.4
          x4 |         23        90.4    35.22369       50.7      168.2
-------------+---------------------------------------------------------
          x5 |         23    124.4304    51.49974       77.4      232.6
          x6 |         23    107.8565    39.81467       65.8      189.4
          ly |         23    3.663887    .1876594   3.325036   3.968403
         lx2 |         23    6.783454    .5700692   5.985195   7.815489
         lx3 |         23     3.84687    .2218151   3.618993   4.254193
-------------+---------------------------------------------------------
         lx4 |         23    4.434111    .3798881   3.925926   5.125154
         lx5 |         23    4.750809    .3798952   4.348987    5.44932
         lx6 |         23    4.619329    .3537303    4.18662   5.243861

. clear

. log close
      name:  <unnamed>
       log:  C:\tmp\stata_out_206983.log
  log type:  text
 closed on:   9 May 2026, 22:41:33
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#+end_example

** Paso 2 — Modelo irrestricto: ecuación (8.6.23)

Estimamos el modelo completo con los cuatro regresores.
=estat ic= reporta AIC y BIC para comparación posterior.

#+BEGIN_SRC stata
use "C:\tmp\gujarati.dta", clear
set linesize 120

regress ly lx2 lx3 lx4 lx5
estat ic
#+END_SRC
#+RESULTS:
#+begin_example
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\tmp\stata_out_210648.log
  log type:  text
 opened on:   9 May 2026, 22:47:47

. use "C:\tmp\gujarati.dta", clear

. set linesize 120

.
. regress ly lx2 lx3 lx4 lx5

      Source |       SS           df       MS      Number of obs   =        23
-------------+----------------------------------   F(4, 18)        =    249.93
       Model |  .761050242         4  .190262561   Prob > F        =    0.0000
    Residual |  .013702848        18  .000761269   R-squared       =    0.9823
-------------+----------------------------------   Adj R-squared   =    0.9784
       Total |   .77475309        22   .03521605   Root MSE        =    .02759

------------------------------------------------------------------------------
          ly | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         lx2 |   .3425546   .0832663     4.11   0.001     .1676186    .5174907
         lx3 |  -.5045934   .1108943    -4.55   0.000    -.7375737   -.2716132
         lx4 |   .1485461   .0996726     1.49   0.153    -.0608583    .3579505
         lx5 |   .0911056   .1007164     0.90   0.378    -.1204917     .302703
       _cons |   2.189793   .1557149    14.06   0.000     1.862648    2.516938
------------------------------------------------------------------------------

. estat ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |          N   ll(null)  ll(model)      df        AIC        BIC
-------------+---------------------------------------------------------------
           . |         23   6.357523   52.75934       5  -95.51868  -89.84121
-----------------------------------------------------------------------------
Note: BIC uses N = number of observations. See [R] IC note.

. clear

. log close
      name:  <unnamed>
       log:  C:\tmp\stata_out_210648.log
  log type:  text
 closed on:   9 May 2026, 22:47:49
------------------------------------------------------------------------------------------------------------------------
#+end_example

** Paso 3 — Prueba de variable redundante

$H_0$: $X_4$ y $X_5$ son conjuntamente insignificantes.
Si no rechazamos $H_0$, los precios de los sustitutos no aportan
poder explicativo adicional al modelo.

#+BEGIN_SRC stata
use "C:\tmp\gujarati.dta", clear

regress ly lx2 lx3 lx4 lx5
test lx4 lx5
#+END_SRC

#+RESULTS:
#+begin_example
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\tmp\stata_out_208901.log
  log type:  text
 opened on:   9 May 2026, 22:42:43

. use "C:\tmp\gujarati.dta", clear

.
. regress ly lx2 lx3 lx4 lx5

      Source |       SS           df       MS      Number of obs   =        23
-------------+----------------------------------   F(4, 18)        =    249.93
       Model |  .761050242         4  .190262561   Prob > F        =    0.0000
    Residual |  .013702848        18  .000761269   R-squared       =    0.9823
-------------+----------------------------------   Adj R-squared   =    0.9784
       Total |   .77475309        22   .03521605   Root MSE        =    .02759

_b_table::do_equations():  3499  member _b_table::titles() not found
--Break--
r(1);

end of do-file
--Break--
r(1);
#+end_example

** Paso 4 — Modelo restringido con precio compuesto de sustitutos

En lugar de dos precios separados ($X_4$, $X_5$), usamos el índice
compuesto $X_6$ que los resume en una sola variable.

#+BEGIN_SRC stata
use "C:\tmp\gujarati.dta", clear
set linesize 120

regress ly lx2 lx3 lx6
estat ic
#+END_SRC

#+RESULTS:
#+begin_example
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\tmp\stata_out_210910.log
  log type:  text
 opened on:   9 May 2026, 22:48:41

. use "C:\tmp\gujarati.dta", clear

. set linesize 120

.
. regress ly lx2 lx3 lx6

      Source |       SS           df       MS      Number of obs   =        23
-------------+----------------------------------   F(3, 19)        =    315.21
       Model |  .759492836         3  .253164279   Prob > F        =    0.0000
    Residual |  .015260254        19  .000803171   R-squared       =    0.9803
-------------+----------------------------------   Adj R-squared   =    0.9772
       Total |   .77475309        22   .03521605   Root MSE        =    .02834

------------------------------------------------------------------------------
          ly | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         lx2 |   .4812864   .0681879     7.06   0.000     .3385675    .6240053
         lx3 |  -.3506282   .0793939    -4.42   0.000    -.5168016   -.1844548
         lx6 |  -.0610352   .1299604    -0.47   0.644    -.3330454    .2109751
       _cons |   2.029865   .1186822    17.10   0.000      1.78146     2.27827
------------------------------------------------------------------------------

. estat ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |          N   ll(null)  ll(model)      df        AIC        BIC
-------------+---------------------------------------------------------------
           . |         23   6.357523   51.52139       4  -95.04278   -90.5008
-----------------------------------------------------------------------------
Note: BIC uses N = number of observations. See [R] IC note.

. clear

. log close
      name:  <unnamed>
       log:  C:\tmp\stata_out_210910.log
  log type:  text
 closed on:   9 May 2026, 22:48:43
------------------------------------------------------------------------------------------------------------------------
#+end_example

** Paso 5 — Comparación formal de modelos (AIC / BIC)

Estimamos ambos modelos y los comparamos en una tabla unificada.
Un menor AIC/BIC indica mejor ajuste penalizado por complejidad.

#+BEGIN_SRC stata
use "C:\tmp\gujarati.dta", clear

quietly regress ly lx2 lx3 lx4 lx5
estimates store m_irrestricto

quietly regress ly lx2 lx3 lx6
estimates store m_restringido

estimates table m_irrestricto m_restringido, ///
    stats(N r2 r2_a aic bic) b(%9.4f) se star
#+END_SRC

#+RESULTS:
#+begin_example
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\tmp\stata_out_209652.log
  log type:  text
 opened on:   9 May 2026, 22:44:30

. use "C:\tmp\gujarati.dta", clear

.
. quietly regress ly lx2 lx3 lx4 lx5

. estimates store m_irrestricto

.
. quietly regress ly lx2 lx3 lx6

. estimates store m_restringido

.
. estimates table m_irrestricto m_restringido, ///
>     stats(N r2 r2_a aic bic) b(%9.4f) se star
option star may not be combined with se, t, or p
r(198);

end of do-file
r(198);
#+end_example

** Paso 6 — Diagnóstico de autocorrelación

Verificamos el atributo 5 (coherencia de datos) con dos pruebas:
- *Durbin-Watson*: detecta autocorrelación de primer orden.
- *Breusch-Godfrey*: más general, detecta órdenes 1 y 2.

#+BEGIN_SRC stata
use "C:\tmp\gujarati.dta", clear

regress ly lx2 lx3 lx4 lx5

estat dwatson

estat bgodfrey, lags(1 2)
#+END_SRC

#+RESULTS:
#+begin_example
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\tmp\stata_out_209376.log
  log type:  text
 opened on:   9 May 2026, 22:44:00

. use "C:\tmp\gujarati.dta", clear

.
. regress ly lx2 lx3 lx4 lx5

      Source |       SS           df       MS      Number of obs   =        23
-------------+----------------------------------   F(4, 18)        =    249.93
       Model |  .761050242         4  .190262561   Prob > F        =    0.0000
    Residual |  .013702848        18  .000761269   R-squared       =    0.9823
-------------+----------------------------------   Adj R-squared   =    0.9784
       Total |   .77475309        22   .03521605   Root MSE        =    .02759

------------------------------------------------------------------------------
          ly | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         lx2 |   .3425546   .0832663     4.11   0.001     .1676186    .5174907
         lx3 |  -.5045934   .1108943    -4.55   0.000    -.7375737   -.2716132
         lx4 |   .1485461   .0996726     1.49   0.153    -.0608583    .3579505
         lx5 |   .0911056   .1007164     0.90   0.378    -.1204917     .302703
       _cons |   2.189793   .1557149    14.06   0.000     1.862648    2.516938
------------------------------------------------------------------------------

.
. estat dwatson
time variable not set, use tsset varname ...
r(111);

end of do-file
r(111);
#+end_example

** Paso 7 — Prueba RESET de Ramsey

Verifica si la forma funcional log-log es adecuada.
$H_0$: el modelo no tiene variables omitidas ni forma funcional incorrecta.
Un rechazo sugiere que deberíamos probar otras transformaciones.

#+BEGIN_SRC stata
use "C:\tmp\gujarati.dta", clear

regress ly lx2 lx3 lx4 lx5
estat ovtest
#+END_SRC

#+RESULTS:
#+begin_example
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\tmp\stata_out_209964.log
  log type:  text
 opened on:   9 May 2026, 22:45:22

. use "C:\tmp\gujarati.dta", clear

.
. regress ly lx2 lx3 lx4 lx5

      Source |       SS           df       MS      Number of obs   =        23
-------------+----------------------------------   F(4, 18)        =    249.93
       Model |  .761050242         4  .190262561   Prob > F        =    0.0000
    Residual |  .013702848        18  .000761269   R-squared       =    0.9823
-------------+----------------------------------   Adj R-squared   =    0.9784
       Total |   .77475309        22   .03521605   Root MSE        =    .02759

------------------------------------------------------------------------------
          ly | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         lx2 |   .3425546   .0832663     4.11   0.001     .1676186    .5174907
         lx3 |  -.5045934   .1108943    -4.55   0.000    -.7375737   -.2716132
         lx4 |   .1485461   .0996726     1.49   0.153    -.0608583    .3579505
         lx5 |   .0911056   .1007164     0.90   0.378    -.1204917     .302703
       _cons |   2.189793   .1557149    14.06   0.000     1.862648    2.516938
------------------------------------------------------------------------------

. estat ovtest

Ramsey RESET test for omitted variables
Omitted: Powers of fitted values of ly

H0: Model has no omitted variables

F(3, 15) =   1.15
Prob > F = 0.3612

. clear

. log close
      name:  <unnamed>
       log:  C:\tmp\stata_out_209964.log
  log type:  text
 closed on:   9 May 2026, 22:45:24
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#+end_example

** Paso 8 — Prueba de Chow (estabilidad estructural, 1973)

La crisis del petróleo de 1973 es un candidato natural para quiebre
estructural. Creamos una dummy =post73= e interactuamos todos los
regresores con ella. Si los coeficientes de interacción son
conjuntamente significativos, los parámetros cambiaron en 1973.

#+BEGIN_SRC stata
use "C:\tmp\gujarati.dta", clear

gen post73 = (año > 1973)

regress ly lx2 lx3 lx4 lx5 ///
    c.lx2#post73 c.lx3#post73 c.lx4#post73 c.lx5#post73 post73

test c.lx2#post73 c.lx3#post73 c.lx4#post73 c.lx5#post73 post73
#+END_SRC

#+RESULTS:
#+begin_example
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\tmp\stata_out_210118.log
  log type:  text
 opened on:   9 May 2026, 22:45:47

. use "C:\tmp\gujarati.dta", clear

.
. gen post73 = (año > 1973)

.
. regress ly lx2 lx3 lx4 lx5 ///
>     c.lx2#post73 c.lx3#post73 c.lx4#post73 c.lx5#post73 post73

      Source |       SS           df       MS      Number of obs   =        23
-------------+----------------------------------   F(9, 13)        =    203.59
       Model |  .769294922         9  .085477214   Prob > F        =    0.0000
    Residual |  .005458168        13  .000419859   R-squared       =    0.9930
-------------+----------------------------------   Adj R-squared   =    0.9881
       Total |   .77475309        22   .03521605   Root MSE        =    .02049

------------------------------------------------------------------------------
          ly | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         lx2 |   .3346696   .0875837     3.82   0.002     .1454565    .5238827
         lx3 |  -.4017342   .1234531    -3.25   0.006    -.6684384   -.1350299
         lx4 |   .2698035   .1021199     2.64   0.020      .049187      .49042
         lx5 |   .0176873   .1234928     0.14   0.888    -.2491027    .2844774
             |
post73#c.lx2 |
          1  |  -.0435023   .1313413    -0.33   0.746    -.3272479    .2402433
             |
post73#c.lx3 |
          1  |   .6817111   .2944423     2.32   0.038     .0456072    1.317815
             |
post73#c.lx4 |
          1  |  -.5908747   .2041789    -2.89   0.013    -1.031976    -.149773
             |
post73#c.lx5 |
          1  |   .1256818   .1601086     0.78   0.447    -.2202118    .4715754
             |
      post73 |  -.3295306   .4439749    -0.74   0.471     -1.28868    .6296189
       _cons |    1.68941   .2848134     5.93   0.000     1.074108    2.304712
------------------------------------------------------------------------------

.
. test c.lx2#post73 c.lx3#post73 c.lx4#post73 c.lx5#post73 post73
c.lx2#post73 not found
r(111);

end of do-file
r(111);
#+end_example

* Referencias

- Gujarati, D. N., & Porter, D. C. (2010). /Econometría/ (5.ª ed.).
  McGraw-Hill. Capítulos 8 y 13.
- Davidson, R., & MacKinnon, J. G. (1981). Several tests for model
  specification in the presence of alternative hypotheses.
  /Econometrica/, 49(3), 781–793.
- Ramsey, J. B. (1969). Tests for specification errors in classical
  linear least-squares regression analysis. /Journal of the Royal
  Statistical Society, Series B/, 31(2), 350–371.
